main.floors.f3_0=
{
    "floorId": "f3_0",
    "title": "樱塔 1F「樱吹雪花小町」",
    "name": "樱塔 1F",
    "bgm": "bgm_tower3.mp3",
    "subtitle": "樱吹雪花小町",
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "flyPoint": [7, 12],
    "defaultGround": 355,
    "images": [],
    "ratio": 1,
    "map": [
    [   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0],
    [   0,20016,20016,20016,20016,20016,20016,20016,20016,20016,20016,20016,20016,20016,   0],
    [   0,20016,20009,20009,20009,20009,20009,20009,20009,20009,20009,20009,20009,20016,   0],
    [   0,20016,  351,   21,    0,  367,    0,  404,    0,  403,   81,  404,20009,20016,   0],
    [   0,20016,20009,20009,20009,20009,   82,20009,20009,20009,20009,    0,20009,20016,   0],
    [   0,20016,20009,    0,   22,20009,   21,20009,  334,   32,20009,   31,20009,20016,   0],
    [   0,20016,20009,  401,    0,   81,    0,20009,   22,  401,20009,    0,20009,20016,   0],
    [   0,20016,20009,   81,20009,20009,  406,20009,20009,   81,20009,   21,20009,20016,   0],
    [   0,20016,20009,   31,    0,20009,    0,20009,  404,  405,20009,    0,20009,20016,   0],
    [   0,20016,20009,    0,  401,20009,  403,20009,  406,20009,20009,  407,20009,20016,   0],
    [   0,20016,20009,20009,   81,20009,    0,20009,   81,20009,   31,    0,20009,20016,   0],
    [   0,20016,20009,   23,  402,20009,  406,    0,    0,   82,    0,  339,20009,20016,   0],
    [   0,20016,20009,20009,20009,20009,20009,  354,20009,20009,20009,20009,20009,20016,   0],
    [   0,20016,20016,20016,20016,20016,20016,20016,20016,20016,20016,20016,20016,20016,   0],
    [   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0]
],
    "firstArrive": [],
    "events": {
        "5,3": [
            "\\t[幽幽子,face_yuyuko_00.png]门是符卡对通过者暂时敞开的边界，需要使用特定的通行凭证也就是钥匙才能打开，不同颜色的门需要对应颜色的钥匙才能打开。",
            "\\t[幽幽子,face_yuyuko_00.png]不过现在看来你是知道钥匙是怎么使用的嘛。",
            "\\t[幽幽子,face_yuyuko_01.png]需要注意带有骷髅头的门会在你走开的一瞬间马上关上，比如在你右边的那扇黄门。",
            "\\t[幽幽子,face_yuyuko_00.png]如果害怕走得太快不小心撞到门或怪物，你可以按住 Shift 键进入低速模式，松开按键就恢复正常速度了。",
            "\\t[幽幽子,face_yuyuko_02.png]来吧，妖梦。让我看看，你还能不能像现在一样，追上我。",
            "\\t[妖梦,face_youmu_01.png]这话听起来像是要把我丢下。",
            {"type": "hide", "remove": true}
        ],
        "7,12": [
            "需要通关该魔塔才能离开。"
        ]
    },
    "changeFloor": {
        "2,3": {
            "floorId": "f3_1",
            "loc": [
                12,
                3
            ]
        }
    },
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "cannotMove": {},
    "autoEvent": {},
    "beforeBattle": {},
    "cannotMoveIn": {},
    "width": 15,
    "height": 15,
    "bgmap": [

],
    "fgmap": [

]
}