main.floors.f3_3=
{
    "floorId": "f3_3",
    "title": "樱塔 4F「樱吹雪花小町」",
    "name": "樱塔 4F",
    "bgm": "bgm_tower3.mp3",
    "subtitle": "樱吹雪花小町",
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "flyPoint": [
        2,
        11
    ],
    "defaultGround": 355,
    "images": [],
    "ratio": 1,
    "map": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,20016,20016,20016,20016,20016,20016,20016,20016,20016,20016,20016,20016,20016,  0],
    [  0,20016,20009,20009,20009,20009,20009,20009,20009,20009,20009,353,20009,20016,  0],
    [  0,20016,20009,  0,406,  0, 31,  0,410,  0,367,  0,20009,20016,  0],
    [  0,20016,20009,  0,20009,20009,20009,20009,20009,20009,20009,20009,20009,20016,  0],
    [  0,20016,20009, 31,  0,404,  0,411,  0, 32,  0,404,20009,20016,  0],
    [  0,20016,20009,20009,20009,20009,20009,20009,20009,20009,20009,  0,20009,20016,  0],
    [  0,20016,20009,  0,404,  0, 31,  0,404,  0, 31,  0,20009,20016,  0],
    [  0,20016,20009,  0,20009,20009,20009,20009,20009,20009,20009,20009,20009,20016,  0],
    [  0,20016,20009,406,  0,403,  0,404,  0, 31,  0,403,20009,20016,  0],
    [  0,20016,20009,20009,20009,20009,20009,20009,20009,20009,20009,  0,20009,20016,  0],
    [  0,20016,351,  0,404,  0, 31,  0,404,  0,336,  0,20009,20016,  0],
    [  0,20016,20009,20009,20009,20009,20009,20009,20009,20009,20009,20009,20009,20016,  0],
    [  0,20016,20016,20016,20016,20016,20016,20016,20016,20016,20016,20016,20016,20016,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "firstArrive": [],
    "events": {
        "10,3": [
            {
                "type": "if",
                "condition": "flag:yuyuko_f3_3",
                "true": [
                    {
                        "type": "exit"
                    }
                ]
            },
            "\t[幽幽子,face_yuyuko_00.png]看到右下角的魔塔能量条了吗？",
            "\t[妖梦,face_youmu_00.png]看到了。",
            "\t[幽幽子,face_yuyuko_00.png]当你损失HP时，那条能量条也会减少对应的数值。",
            "\t[幽幽子,face_yuyuko_00.png]而当这条能量条耗尽时，敌方角色将会发动符卡，也就是会进入BOSS战。",
            "\t[妖梦,face_youmu_00.png]那就是说，受伤到了那种程度，就会把对方逼急？",
            "\t[幽幽子,face_yuyuko_00.png]差不多。",
            "\t[妖梦,face_youmu_00.png]这听起来一点都不轻松……",
            "\t[幽幽子,face_yuyuko_00.png]所以才要好好看着自己的 HP 哦。",
            {
                "type": "function",
                "function": "function(){\ncore.setFlag('yuyuko_f3_3',1)\n}"
            },
            {
                "type": "hide",
                "remove": true
            }
        ]
    },
    "changeFloor": {
        "11,2": {
            "floorId": "f3_4",
            "loc": [
                11,
                2
            ]
        },
        "2,11": {
            "floorId": "f3_2",
            "loc": [
                12,
                11
            ]
        }
    },
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "cannotMove": {},
    "autoEvent": {},
    "beforeBattle": {},
    "cannotMoveIn": {},
    "width": 15,
    "height": 15,
    "bgmap": [

],
    "fgmap": [

]
}